<script>
	import $ from "jquery"; 
	import APIHelper from "../mixins/APIHelper.js";
    
	export default{
		mixins:[APIHelper],
		data(){
			return{
				//Varible area
			}
		},
		methods:{
			//Methods area
		},
		mounted(){
			//Init component method
		}
	}
</script>

<template>
	<article>
		<h1 class="text-center">О нас</h1>
		<div class="panel mx-3">
			<p class="font">
				Данный сайт предоставляет возможность пользователям скачивать и смотреть онлайн фильмы и сериалы. 
				На данный момент всё работает локально, тоесть без подключения к интернету. 
				В качестве источника контента используется ВЖД (внешний жёсткий диск) что означает с одной стороны
				 достаточно разноообразие наполнения, но с другой ограничения в скорости работы и в месте 
				 (да, всего 2 ТБ, что звучит как много, но на деле это не много).
			</p>
			<p class="m-0 font">
				В дальнейшем проект будет развиваться. 
				 Изначально то он вообще предпологался для домашнего использования, как интерфейс между ВЖД и телефоном 
				 (или ноутбуком, смотря с чего смотреть). 
				Но сейчас появляется множество интересных идей по улучшению, в том числе и с выводом всего этого 
				 в глобальную сеть (пока что сложно это). 
			</p>
			<p class="font">
				В любом случае, так как разработку ведёт всего 1 человек (тоесть и сайт и сервер и всё остальное я пишу сам и один),
				 разработка движется семимильными шагами лилипутов (медленно в общем). 
				И по этой же причине, ошибки и прочие глюки возможны (мягко говоря). 
				О подобных просьба незамедлительно сообщать (ибо такое в первую очередь нужно править). 
				Полагаю как связаться со мной вы знаете...</p>
			<p class="m-0 font">
				И ещё один не маловажный аспект, "сервером" в данном случае служит ноутбук. 
				Он кончено очень хороший, но лишний раз лучше его не мучить. 
				Он всё сделает, но вот времени на это может уйти прилично. 
				Важно отметить, что скачивание без конвертации требует оочень мало ресурсов,
				 в вот всё, что связано с конвертацией (просмотр онлайн зачастую тоже) может в самом начала быть маленько долго. 
			</p>
			<p class="font">
				В любом случае удачного пользования, надеюсь я помог (ну, хотя бы частично).
			</p>
			<p class="m-0 fw-bold font">Полезные ссылки:</p>
			<a class="ms-2 font" href="https://github.com/KuzarinM/OnlineCinema">-Исходный код(github)</a>
		</div>
	</article>
</template>

<style scoped>
	.font{
		font-family : "Comic Sans MS";
	}
</style>
